Taller or Lab Fabian Ni√±o

In [1]:
import pandas as pd

In [4]:
#Diccionario
x={"panadero":["pedro","juan","rocio","Fabian"],"cocina":["pan","postres","pan","huevo"]}
x

{'panadero': ['pedro', 'juan', 'rocio', 'Fabian'],
 'cocina': ['pan', 'postres', 'pan', 'huevo']}

In [6]:
#crear dataframe
datframe=pd.DataFrame(x)
datframe

  panadero   cocina
0    pedro      pan
1     juan  postres
2    rocio      pan
3   Fabian    huevo

In [7]:
#imprimir
datframe

  panadero   cocina
0    pedro      pan
1     juan  postres
2    rocio      pan
3   Fabian    huevo

In [9]:
#seleccionar por colunma
datframe["panadero"]

0     pedro
1      juan
2     rocio
3    Fabian
Name: panadero, dtype: object

In [13]:
#tipo
type(datframe)

pandas.core.frame.DataFrame

In [15]:
#Diccionario con 3 columnas
x1={"panadero":["pedro","juan","rocio","Fabian"],"cocina":["pan","postres","pan","huevo"],"edad":[23,34,54,21]}
x1

{'panadero': ['pedro', 'juan', 'rocio', 'Fabian'],
 'cocina': ['pan', 'postres', 'pan', 'huevo'],
 'edad': [23, 34, 54, 21]}

In [18]:
#crear diccionario luego dataframe y seleccionar 2 columnas
df=pd.DataFrame(x1)
z=df[["panadero","edad"]]
z

  panadero  edad
0    pedro    23
1     juan    34
2    rocio    54
3   Fabian    21

In [21]:
df.iloc[0,1]

'pan'

In [22]:
df.iloc[0,0]

'pedro'

In [24]:
df.loc[2,"panadero"]

'rocio'

In [25]:
df.head()

  panadero   cocina  edad
0    pedro      pan    23
1     juan  postres    34
2    rocio      pan    54
3   Fabian    huevo    21

In [27]:
df.set_index("index")
df.head()

KeyError: "None of ['index'] are in the columns"